11-vllm-internals/prefix-cache/vllm-prefix-cache.log
========================================
vLLM Prefix Caching Enabled
Date: Fri Sep 25 07:13:52 AM UTC 2026
========================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x78d25d743600>, trust_remote_code=False, seed=4000, num_prompts=20, dataset_name='prefix_repetition', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=2048, prefix_repetition_suffix_len=128, prefix_repetition_num_prefixes=1, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen/Qwen2.5-7B-Instruct-AWQ', input_len=None, output_len=None, tokenizer='Qwen/Qwen2.5-7B-Instruct', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-c63a49c9-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='qwen2.5-7b-awq', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
WARNING: /tokenize unavailable, skipping alignment.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 20/20 [00:33<00:00,  1.67s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     20        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  33.47     
Total input tokens:                      44100     
Total generated tokens:                  1980      
Request throughput (req/s):              0.60      
Output token throughput (tok/s):         59.16     
Peak output token throughput (tok/s):    66.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          1376.81   
---------------Time to First Token----------------
Mean TTFT (ms):                          185.72    
Median TTFT (ms):                        133.67    
P50 TTFT (ms):                           133.67    
P95 TTFT (ms):                           207.87    
P99 TTFT (ms):                           1052.46   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          15.17     
Median TPOT (ms):                        15.14     
P50 TPOT (ms):                           15.14     
P95 TPOT (ms):                           15.26     
P99 TPOT (ms):                           15.31     
---------------Inter-token Latency----------------
Mean ITL (ms):                           15.02     
Median ITL (ms):                         15.22     
P50 ITL (ms):                            15.22     
P95 ITL (ms):                            15.96     
P99 ITL (ms):                            16.77     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          1672.85   
Median E2EL (ms):                        1786.58   
P50 E2EL (ms):                           1786.58   
P95 E2EL (ms):                           2094.21   
P99 E2EL (ms):                           2226.36   
==================================================